[Survived] Block removal mutation
common/Account.cs:18:5
     private double _saldo;
 
     public Account()
-    {
-        _saldo = 0.0;
-    }
+    {}
 
     public double AccountStatus()

[Killed] Block removal mutation
common/Account.cs:23:5
     }
 
     public double AccountStatus()
-    {
-        return _saldo;
-    }
+    {}
 
     public double DepositFunds(double amount)
killedBy: BankomatUJ.Tests.tests.AccountTest.AccountStatusMethodAfterDepositFundsTest1(5,"elo",True); BankomatUJ.Tests.tests.AccountTest.AccountStatusMethodAfterDepositFundsTest1(2,"elo",True); BankomatUJ.Tests.tests.AccountTest.AccountStatusMethodAfterDepositFundsTest1(7,"elo",True)

[Killed] Equality mutation
common/Account.cs:29:13
 
     public double DepositFunds(double amount)
     {
-        if (amount <= 0)
+        if (amount > 0)
         {
             throw new ArgumentException("Wartość depozytu powinna być większa od zera!");
killedBy: BankomatUJ.Tests.tests.AccountTest.AccountStatusMethodAfterDepositFundsTest1(5,"elo",True); BankomatUJ.Tests.tests.AccountTest.AccountStatusMethodAfterDepositFundsTest1(2,"elo",True); BankomatUJ.Tests.tests.AccountTest.AccountStatusMethodAfterDepositFundsTest1(7,"elo",True)

[Killed] Negate expression
common/Account.cs:29:13
 
     public double DepositFunds(double amount)
     {
-        if (amount <= 0)
+        if (!(amount <= 0))
         {
             throw new ArgumentException("Wartość depozytu powinna być większa od zera!");
killedBy: BankomatUJ.Tests.tests.AccountTest.AccountStatusMethodAfterDepositFundsTest1(5,"elo",True); BankomatUJ.Tests.tests.AccountTest.AccountStatusMethodAfterDepositFundsTest1(2,"elo",True); BankomatUJ.Tests.tests.AccountTest.AccountStatusMethodAfterDepositFundsTest1(7,"elo",True)

[Killed] Statement mutation
common/Account.cs:31:13
     {
         if (amount <= 0)
         {
-            throw new ArgumentException("Wartość depozytu powinna być większa od zera!");
+            ;
         }
 
killedBy: BankomatUJ.Tests.tests.AccountTest.DepositFundsMethodIncorrectParameterTest1; BankomatUJ.Tests.tests.AccountTest.DepositFundsMethodIncorrectParameterTest2; BankomatUJ.Tests.tests.AccountTest.DepositFundsMethodIncorrectParameterTest3

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
common/Account.cs:34:9
             throw new ArgumentException("Wartość depozytu powinna być większa od zera!");
         }
 
-        _saldo += amount;
+        _saldo -= amount;
         return _saldo;
     }
killedBy: BankomatUJ.Tests.tests.AccountTest.AccountStatusMethodAfterDepositFundsTest1(5,"elo",True); BankomatUJ.Tests.tests.AccountTest.AccountStatusMethodAfterDepositFundsTest1(2,"elo",True); BankomatUJ.Tests.tests.AccountTest.AccountStatusMethodAfterDepositFundsTest1(7,"elo",True)

[Killed] Statement mutation
common/Account.cs:42:13
     {
         if (amount <= 0)
         {
-            throw new ArgumentException("Wartość wypłaty powinna być większa od zera!");
+            ;
         }
 
killedBy: BankomatUJ.Tests.tests.AccountTest.WithdrawFundsMethodIncorrectParameterTest3; BankomatUJ.Tests.tests.AccountTest.WithdrawFundsMethodIncorrectParameterTest4

[Killed] Arithmetic mutation
common/Account.cs:45:13
             throw new ArgumentException("Wartość wypłaty powinna być większa od zera!");
         }
 
-        if (_saldo - amount < 0)
+        if (_saldo + amount < 0)
         {
             throw new ArgumentException("Nie wystarczająca kwota na koncie!");
killedBy: BankomatUJ.Tests.tests.AccountTest.WithdrawFundsMethodIncorrectParameterTest1; BankomatUJ.Tests.tests.AccountTest.WithdrawFundsMethodIncorrectParameterTest2

[Killed] Equality mutation
common/Account.cs:45:13
             throw new ArgumentException("Wartość wypłaty powinna być większa od zera!");
         }
 
-        if (_saldo - amount < 0)
+        if (_saldo - amount > 0)
         {
             throw new ArgumentException("Nie wystarczająca kwota na koncie!");
killedBy: BankomatUJ.Tests.tests.AccountTest.AccountStatusMethodAfterWithdrawFundsTest1; BankomatUJ.Tests.tests.AccountTest.AccountStatusMethodAfterWithdrawFundsTest2; BankomatUJ.Tests.tests.AccountTest.WithdrawFundsMethodCorrectParameterTest1

[Killed] Statement mutation
common/Account.cs:47:13
 
         if (_saldo - amount < 0)
         {
-            throw new ArgumentException("Nie wystarczająca kwota na koncie!");
+            ;
         }
 
killedBy: BankomatUJ.Tests.tests.AccountTest.WithdrawFundsMethodIncorrectParameterTest1; BankomatUJ.Tests.tests.AccountTest.WithdrawFundsMethodIncorrectParameterTest2

[Survived] String mutation
common/Account.cs:47:41
 
         if (_saldo - amount < 0)
         {
-            throw new ArgumentException("Nie wystarczająca kwota na koncie!");
+            throw new ArgumentException("");
         }
 

[Killed] SubtractAssignmentExpression to AddAssignmentExpression mutation
common/Account.cs:50:9
             throw new ArgumentException("Nie wystarczająca kwota na koncie!");
         }
 
-        _saldo -= amount;
+        _saldo += amount;
         return _saldo;
     }
killedBy: BankomatUJ.Tests.tests.AccountTest.AccountStatusMethodAfterWithdrawFundsTest1; BankomatUJ.Tests.tests.AccountTest.AccountStatusMethodAfterWithdrawFundsTest2; BankomatUJ.Tests.tests.AccountTest.AccountStatusMethodAfterWithdrawFundsTest3
