[Killed] Equality mutation
common/Atm.cs:22:13
 
     public bool CheckPinAndLogIn(ICreditCard? creditCard, string pin)
     {
-        if (creditCard == null)
+        if (creditCard != null)
         {
             throw new ArgumentException("Dana karta nie istnieje!");
killedBy: BankomatUJ.Tests.tests.AtmTest.CheckPinAndLogInMethodCorrectParameterTest; BankomatUJ.Tests.tests.AtmTest.CheckPinAndLogInMethodIncorrectParameterTest1; BankomatUJ.Tests.tests.AtmTest.CheckPinAndLogInMethodIncorrectParameterTest2

[Killed] Statement mutation
common/Atm.cs:24:13
     {
         if (creditCard == null)
         {
-            throw new ArgumentException("Dana karta nie istnieje!");
+            ;
         }
 
killedBy: BankomatUJ.Tests.tests.AtmTest.CheckPinAndLogInMethodIncorrectParameterTest1

[Killed] Equality mutation
common/Atm.cs:33:13
 
     public double AccountStatus(IAccount? account)
     {
-        if (account == null)
+        if (account != null)
         {
             throw new ArgumentException("Dane konto nie istnieje!");
killedBy: BankomatUJ.Tests.tests.AtmTest.AccountStatusMethodCorrectParameterTest; BankomatUJ.Tests.tests.AtmTest.AccountStatusMethodIncorrectParameterTest1

[Killed] Statement mutation
common/Atm.cs:35:13
     {
         if (account == null)
         {
-            throw new ArgumentException("Dane konto nie istnieje!");
+            ;
         }
 
killedBy: BankomatUJ.Tests.tests.AtmTest.AccountStatusMethodIncorrectParameterTest1

[Survived] String mutation
common/Atm.cs:35:41
     {
         if (account == null)
         {
-            throw new ArgumentException("Dane konto nie istnieje!");
+            throw new ArgumentException("");
         }
 

[Killed] Equality mutation
common/Atm.cs:44:13
 
     public bool ChangePinCard(ICreditCard? card, string oldPin, string newPin, string newPinConfirm)
     {
-        if (card == null)
+        if (card != null)
         {
             throw new ArgumentException("Dana karta nie istnieje!");
killedBy: BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodCorrectParameterTest; BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodIncorrectParameterTest1; BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodIncorrectParameterTest2

[Survived] String mutation
common/Atm.cs:46:41
     {
         if (card == null)
         {
-            throw new ArgumentException("Dana karta nie istnieje!");
+            throw new ArgumentException("");
         }
 

[Killed] Equality mutation
common/Atm.cs:82:13
             throw new ArgumentException("Dana karta nie istnieje!");
         }
 
-        if (accountRecipient == null)
+        if (accountRecipient != null)
         {
             throw new ArgumentException("Dane konto nie istnieje!");
killedBy: BankomatUJ.Tests.tests.AtmTest.TransferMethodCorrectParameterTest1; BankomatUJ.Tests.tests.AtmTest.TransferMethodCorrectParameterTest2; BankomatUJ.Tests.tests.AtmTest.TransferMethodIncorrectParameterTest1

[Killed] Equality mutation
common/Atm.cs:87:13
             throw new ArgumentException("Dane konto nie istnieje!");
         }
 
-        if (card.GetAccount().AccountStatus() >= amount && card.WithdrawFunds(amount))
+        if (card.GetAccount().AccountStatus() > amount && card.WithdrawFunds(amount))
         {
             accountRecipient.DepositFunds(amount);
killedBy: BankomatUJ.Tests.tests.AtmTest.TransferMethodCorrectParameterTest2

[Killed] Negate expression
common/Atm.cs:87:13
             throw new ArgumentException("Dane konto nie istnieje!");
         }
 
-        if (card.GetAccount().AccountStatus() >= amount && card.WithdrawFunds(amount))
+        if (!(card.GetAccount().AccountStatus() >= amount && card.WithdrawFunds(amount)))
         {
             accountRecipient.DepositFunds(amount);
killedBy: BankomatUJ.Tests.tests.AtmTest.TransferMethodCorrectParameterTest1; BankomatUJ.Tests.tests.AtmTest.TransferMethodCorrectParameterTest2; BankomatUJ.Tests.tests.AtmTest.TransferMethodIncorrectParameterTest1

[Killed] Statement mutation
common/Atm.cs:89:13
 
         if (card.GetAccount().AccountStatus() >= amount && card.WithdrawFunds(amount))
         {
-            accountRecipient.DepositFunds(amount);
+            ;
             return true;
         }
killedBy: BankomatUJ.Tests.tests.AtmTest.TransferMethodCorrectParameterTest1; BankomatUJ.Tests.tests.AtmTest.TransferMethodCorrectParameterTest2

[Killed] Boolean mutation
common/Atm.cs:90:20
         if (card.GetAccount().AccountStatus() >= amount && card.WithdrawFunds(amount))
         {
             accountRecipient.DepositFunds(amount);
-            return true;
+            return false;
         }
 
killedBy: BankomatUJ.Tests.tests.AtmTest.TransferMethodCorrectParameterTest1; BankomatUJ.Tests.tests.AtmTest.TransferMethodCorrectParameterTest2
