[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
common/CreditCard.cs:27:13
 
     public void Init(string newPin, string newPinConfirm)
     {
-        if (!newPin.Equals(newPinConfirm))
+        if (newPin.Equals(newPinConfirm))
         {
             throw new ArgumentException("Podałeś dwa różne piny! Pin i pin weryfikujący muszą być takie same!");
killedBy: BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodCorrectParameterTest; BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodIncorrectParameterTest2; BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodIncorrectParameterTest3

[Killed] Statement mutation
common/CreditCard.cs:29:13
     {
         if (!newPin.Equals(newPinConfirm))
         {
-            throw new ArgumentException("Podałeś dwa różne piny! Pin i pin weryfikujący muszą być takie same!");
+            ;
         }
 
killedBy: BankomatUJ.Tests.tests.CreditCardTest.CreditCardInitMethodIncorrectParameterTest1

[Killed] Equality mutation
common/CreditCard.cs:32:13
             throw new ArgumentException("Podałeś dwa różne piny! Pin i pin weryfikujący muszą być takie same!");
         }
 
-        if (newPin.Length != 4)
+        if (newPin.Length == 4)
         {
             throw new ArgumentException("Pin musi składać się z 4 cyfr!");
killedBy: BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodCorrectParameterTest; BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodIncorrectParameterTest2; BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodIncorrectParameterTest3

[Killed] Statement mutation
common/CreditCard.cs:34:13
 
         if (newPin.Length != 4)
         {
-            throw new ArgumentException("Pin musi składać się z 4 cyfr!");
+            ;
         }
 
killedBy: BankomatUJ.Tests.tests.CreditCardTest.CreditCardInitMethodIncorrectParameterTest2

[Killed] PostIncrementExpression to PostDecrementExpression mutation
common/CreditCard.cs:37:44
             throw new ArgumentException("Pin musi składać się z 4 cyfr!");
         }
 
-        for (var i = 0; i < newPin.Length; i++)
+        for (var i = 0; i < newPin.Length; i--)
         {
             var c = newPin[i];
killedBy: BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodCorrectParameterTest; BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodIncorrectParameterTest2; BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodIncorrectParameterTest3

[Killed] Equality mutation
common/CreditCard.cs:37:25
             throw new ArgumentException("Pin musi składać się z 4 cyfr!");
         }
 
-        for (var i = 0; i < newPin.Length; i++)
+        for (var i = 0; i <= newPin.Length; i++)
         {
             var c = newPin[i];
killedBy: BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodCorrectParameterTest; BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodIncorrectParameterTest2; BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodIncorrectParameterTest3

[Killed] Equality mutation
common/CreditCard.cs:40:22
         for (var i = 0; i < newPin.Length; i++)
         {
             var c = newPin[i];
-            if (c is < '0' or > '9')
+            if (c is not < '0' or > '9')
             {
                 throw new ArgumentException("Pin musi składać się z 4 cyfr!");
killedBy: BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodCorrectParameterTest; BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodIncorrectParameterTest2; BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodIncorrectParameterTest3

[Killed] Equality mutation
common/CreditCard.cs:40:22
         for (var i = 0; i < newPin.Length; i++)
         {
             var c = newPin[i];
-            if (c is < '0' or > '9')
+            if (c is > '0' or > '9')
             {
                 throw new ArgumentException("Pin musi składać się z 4 cyfr!");
killedBy: BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodCorrectParameterTest; BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodIncorrectParameterTest2; BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodIncorrectParameterTest3

[Killed] Negate expression
common/CreditCard.cs:52:13
 
     public bool ChangePin(string oldPin, string newPin, string newPinConfirm)
     {
-        if (_pin.Equals(oldPin) && newPin.Equals(newPinConfirm) && newPin.Length == 4)
+        if (!(_pin.Equals(oldPin) && newPin.Equals(newPinConfirm) && newPin.Length == 4))
         {
             for (var i = 0; i < newPin.Length; i++)
killedBy: BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodCorrectParameterTest; BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodIncorrectParameterTest2; BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodIncorrectParameterTest3

[Killed] Logical mutation
common/CreditCard.cs:52:13
 
     public bool ChangePin(string oldPin, string newPin, string newPinConfirm)
     {
-        if (_pin.Equals(oldPin) && newPin.Equals(newPinConfirm) && newPin.Length == 4)
+        if (_pin.Equals(oldPin) && newPin.Equals(newPinConfirm) || newPin.Length == 4)
         {
             for (var i = 0; i < newPin.Length; i++)
killedBy: BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodIncorrectParameterTest2; BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodIncorrectParameterTest3; BankomatUJ.Tests.tests.CreditCardTest.ChangePinMethodIncorrectParameterTest1

[Killed] PostIncrementExpression to PostDecrementExpression mutation
common/CreditCard.cs:54:48
     {
         if (_pin.Equals(oldPin) && newPin.Equals(newPinConfirm) && newPin.Length == 4)
         {
-            for (var i = 0; i < newPin.Length; i++)
+            for (var i = 0; i < newPin.Length; i--)
             {
                 var c = newPin[i];
killedBy: BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodCorrectParameterTest; BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodIncorrectParameterTest4; BankomatUJ.Tests.tests.CreditCardTest.ChangePinMethodCorrectParameterTest

[Killed] Equality mutation
common/CreditCard.cs:54:29
     {
         if (_pin.Equals(oldPin) && newPin.Equals(newPinConfirm) && newPin.Length == 4)
         {
-            for (var i = 0; i < newPin.Length; i++)
+            for (var i = 0; i > newPin.Length; i++)
             {
                 var c = newPin[i];
killedBy: BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodIncorrectParameterTest4

[Killed] Boolean mutation
common/CreditCard.cs:64:20
             }
 
             _pin = newPin;
-            return true;
+            return false;
         }
 
killedBy: BankomatUJ.Tests.tests.AtmTest.ChangePinCardMethodCorrectParameterTest; BankomatUJ.Tests.tests.CreditCardTest.ChangePinMethodCorrectParameterTest

[Killed] Equality mutation
common/CreditCard.cs:73:13
 
     public bool IsPinValid(string pin)
     {
-        if (pin.Length != 4)
+        if (pin.Length == 4)
         {
             return false;
killedBy: BankomatUJ.Tests.tests.AtmTest.CheckPinAndLogInMethodCorrectParameterTest

[Killed] PostIncrementExpression to PostDecrementExpression mutation
common/CreditCard.cs:78:41
             return false;
         }
 
-        for (var i = 0; i < pin.Length; i++)
+        for (var i = 0; i < pin.Length; i--)
         {
             var c = pin[i];
killedBy: BankomatUJ.Tests.tests.AtmTest.CheckPinAndLogInMethodCorrectParameterTest; BankomatUJ.Tests.tests.AtmTest.CheckPinAndLogInMethodIncorrectParameterTest3; BankomatUJ.Tests.tests.CreditCardTest.IsPinValidMethodCorrectParameterTest

[Killed] Equality mutation
common/CreditCard.cs:78:25
             return false;
         }
 
-        for (var i = 0; i < pin.Length; i++)
+        for (var i = 0; i <= pin.Length; i++)
         {
             var c = pin[i];
killedBy: BankomatUJ.Tests.tests.AtmTest.CheckPinAndLogInMethodCorrectParameterTest; BankomatUJ.Tests.tests.CreditCardTest.IsPinValidMethodCorrectParameterTest; BankomatUJ.Tests.tests.CreditCardTest.IsPinValidMethodIncorrectParameterTest1

[Killed] Equality mutation
common/CreditCard.cs:81:31
         for (var i = 0; i < pin.Length; i++)
         {
             var c = pin[i];
-            if (c is < '0' or > '9')
+            if (c is < '0' or < '9')
             {
                 return false;
killedBy: BankomatUJ.Tests.tests.AtmTest.CheckPinAndLogInMethodCorrectParameterTest; BankomatUJ.Tests.tests.CreditCardTest.IsPinValidMethodCorrectParameterTest

[Killed] Equality mutation
common/CreditCard.cs:81:22
         for (var i = 0; i < pin.Length; i++)
         {
             var c = pin[i];
-            if (c is < '0' or > '9')
+            if (c is > '0' or > '9')
             {
                 return false;
killedBy: BankomatUJ.Tests.tests.AtmTest.CheckPinAndLogInMethodCorrectParameterTest; BankomatUJ.Tests.tests.CreditCardTest.IsPinValidMethodCorrectParameterTest

[Killed] Equality mutation
common/CreditCard.cs:93:13
 
     public void AddAccount(IAccount? account)
     {
-        if (this._account != null)
+        if (this._account == null)
         {
             throw new ArgumentException("Ta karta jest już dodana do jakiegoś konta!");
killedBy: BankomatUJ.Tests.tests.AtmTest.DepositFundsMethodCorrectParameterTest; BankomatUJ.Tests.tests.AtmTest.DepositFundsMethodIncorrectParameterTest2; BankomatUJ.Tests.tests.AtmTest.DepositFundsMethodIncorrectParameterTest3

[Killed] Statement mutation
common/CreditCard.cs:95:13
     {
         if (this._account != null)
         {
-            throw new ArgumentException("Ta karta jest już dodana do jakiegoś konta!");
+            ;
         }
 
killedBy: BankomatUJ.Tests.tests.CreditCardTest.AddAccountMethodIncorrectParameterTest2

[Killed] Equality mutation
common/CreditCard.cs:98:13
             throw new ArgumentException("Ta karta jest już dodana do jakiegoś konta!");
         }
 
-        if (account == null)
+        if (account != null)
         {
             throw new ArgumentException("Dodawane konto nie istnieje!");
killedBy: BankomatUJ.Tests.tests.AtmTest.DepositFundsMethodCorrectParameterTest; BankomatUJ.Tests.tests.AtmTest.DepositFundsMethodIncorrectParameterTest2; BankomatUJ.Tests.tests.AtmTest.DepositFundsMethodIncorrectParameterTest3

[Killed] Statement mutation
common/CreditCard.cs:100:13
 
         if (account == null)
         {
-            throw new ArgumentException("Dodawane konto nie istnieje!");
+            ;
         }
 
killedBy: BankomatUJ.Tests.tests.CreditCardTest.AddAccountMethodIncorrectParameterTest1

[Survived] String mutation
common/CreditCard.cs:100:41
 
         if (account == null)
         {
-            throw new ArgumentException("Dodawane konto nie istnieje!");
+            throw new ArgumentException("");
         }
 

[Killed] Equality mutation
common/CreditCard.cs:109:13
 
     public IAccount GetAccount()
     {
-        if (_account == null)
+        if (_account != null)
         {
             throw new ArgumentException("Ta karta nie jest jeszcze dodana do żadnego konta!");
killedBy: BankomatUJ.Tests.tests.AtmTest.TransferMethodCorrectParameterTest1; BankomatUJ.Tests.tests.AtmTest.TransferMethodCorrectParameterTest2; BankomatUJ.Tests.tests.AtmTest.TransferMethodIncorrectParameterTest1

[Killed] Statement mutation
common/CreditCard.cs:111:13
     {
         if (_account == null)
         {
-            throw new ArgumentException("Ta karta nie jest jeszcze dodana do żadnego konta!");
+            ;
         }
 
killedBy: BankomatUJ.Tests.tests.CreditCardTest.GetAccountMethodIncorrectParameterTest

[Survived] String mutation
common/CreditCard.cs:111:41
     {
         if (_account == null)
         {
-            throw new ArgumentException("Ta karta nie jest jeszcze dodana do żadnego konta!");
+            throw new ArgumentException("");
         }
 

[Killed] Logical mutation
common/CreditCard.cs:120:13
 
     public bool DepositFunds(double amount)
     {
-        if (_account != null && amount > 0)
+        if (_account != null || amount > 0)
         {
             _account.DepositFunds(amount);
killedBy: BankomatUJ.Tests.tests.AtmTest.DepositFundsMethodIncorrectParameterTest1; BankomatUJ.Tests.tests.AtmTest.DepositFundsMethodIncorrectParameterTest2

[Killed] Negate expression
common/CreditCard.cs:120:13
 
     public bool DepositFunds(double amount)
     {
-        if (_account != null && amount > 0)
+        if (!(_account != null && amount > 0))
         {
             _account.DepositFunds(amount);
killedBy: BankomatUJ.Tests.tests.AtmTest.DepositFundsMethodCorrectParameterTest; BankomatUJ.Tests.tests.AtmTest.DepositFundsMethodIncorrectParameterTest1; BankomatUJ.Tests.tests.AtmTest.DepositFundsMethodIncorrectParameterTest2

[Killed] Statement mutation
common/CreditCard.cs:122:13
     {
         if (_account != null && amount > 0)
         {
-            _account.DepositFunds(amount);
+            ;
             return true;
         }
killedBy: BankomatUJ.Tests.tests.AtmTest.TransferMethodCorrectParameterTest1; BankomatUJ.Tests.tests.AtmTest.TransferMethodCorrectParameterTest2; BankomatUJ.Tests.tests.AtmTest.TransferMethodIncorrectParameterTest1

[Killed] Boolean mutation
common/CreditCard.cs:123:20
         if (_account != null && amount > 0)
         {
             _account.DepositFunds(amount);
-            return true;
+            return false;
         }
 
killedBy: BankomatUJ.Tests.tests.AtmTest.DepositFundsMethodCorrectParameterTest

[Killed] Equality mutation
common/CreditCard.cs:132:33
 
     public bool WithdrawFunds(double amount)
     {
-        if (_account != null && amount > 0)
+        if (_account != null && amount < 0)
         {
             _account.WithdrawFunds(amount);
killedBy: BankomatUJ.Tests.tests.AtmTest.TransferMethodCorrectParameterTest1; BankomatUJ.Tests.tests.AtmTest.TransferMethodCorrectParameterTest2; BankomatUJ.Tests.tests.AtmTest.TransferMethodIncorrectParameterTest2

[Killed] Statement mutation
common/CreditCard.cs:134:13
     {
         if (_account != null && amount > 0)
         {
-            _account.WithdrawFunds(amount);
+            ;
             return true;
         }
killedBy: BankomatUJ.Tests.tests.AtmTest.TransferMethodCorrectParameterTest1; BankomatUJ.Tests.tests.AtmTest.TransferMethodCorrectParameterTest2

[Killed] Boolean mutation
common/CreditCard.cs:135:20
         if (_account != null && amount > 0)
         {
             _account.WithdrawFunds(amount);
-            return true;
+            return false;
         }
 
killedBy: BankomatUJ.Tests.tests.AtmTest.TransferMethodCorrectParameterTest1; BankomatUJ.Tests.tests.AtmTest.TransferMethodCorrectParameterTest2; BankomatUJ.Tests.tests.AtmTest.WithdrawFundsMethodCorrectParameterTest
